{"meta":{"title":"Lakeisha's Lab","subtitle":"Enjoy the recipes 😊","description":"Recipes from all cultures","author":"Lakeisha Pogrzeba","url":"https://www.lakeisha.ca"},"pages":[{"title":"about","date":"2018-11-02T19:00:38.000Z","updated":"2018-11-09T19:58:35.249Z","comments":true,"path":"about/index.html","permalink":"https://www.lakeisha.ca/about/index.html","excerpt":"","text":"Hi! 👋My name is Lakeisha and welcome to my website! ♓️ I’m a passionate foodie with no official culinary training! I hope that doesn’t deter you from trying my recipes 💁‍♀️ I have however learned from many of the people I’ve met 🙌, and devote a lot of time to researching food, and self experimentation 🔬. I enjoy food from all cultures 🌎🌍🌏! I have a long list of recipes that I am working toward putting up here, as well as many recipes I’d like to try! I like to work like a micro processor 💻. Meaning, I do as much as possible in parallel, so my recipe methods aims to save time! I’m vegan 🌱 and those are the only recipes you’ll find here! I enjoy the challenge and creativity needed to veganize all recipes! 🆒 If you have any questions comments or suggestions(such as recipes), feel free to reach out! 💌 ~ more about me to come"},{"title":"ingredients","date":"2019-10-10T05:00:00.000Z","updated":"2019-11-11T04:49:23.087Z","comments":true,"path":"ingredients/index.html","permalink":"https://www.lakeisha.ca/ingredients/index.html","excerpt":"","text":"Ingredients A work in progress collecting my data on ingredients; where to find them, prices, nutritional info, tips. Agave SyrupAniseArugulaBasilBell PepperBananaBlack CardamomBlack BeansBlack PepperCashewsA whole food containing fat and oil. very versatile, soak in warm water when blending. Use in cheeze dips, pasta sauce, indian currys, mac and nooch sauce etc CarrotCeleryCilantroCinnamonChicken style broth (vegan)bulk barn has this and it is amazing. comes in powder form. Great for seasonings and tofu and potentially anywhere you would use vegetable broth. ChardCloveCumin / JeeraDatesDillFenugreekFigsGalangalThis one can be hard to find. Sometimes the TNT on Cherry Road has it, but the TNT in mississauaga is more a gaurantee. You can also try Sunny’s or Bestco or any other Chinese/Thai Grocery stores.The taste is quite different than Ginger. Its more sweet and bitter rather than spicy like ginger. It can also be called Thai Ginger. GarlicGingerGreen CardamomGreen OnionJalapeno PepperKaleLentilLemon grassMaple SyrupMangoMustard seedsNutritional YeastOatsCanada is a major exporter on oats. Chances are your oats are from Saskatchewan.Very healthy, like a pressure washer for your arteries. High in protein. Oliveswhole food with oil. Fry in onions for pasta Olive Oil3:1 ration of omega3-omega6, which is good. low heat oil, good for salads. I still try to limit my intake as it is calorie dense. OreganoOnionParsleymain ingredient in tabule PaprikaPomengranatePomengranate seedscrucial ingredient for channa masala Potato Russet Yukon Gold Red Kidney BeansRice NoodlesSaltShallotSmoked PaprikaSoy BeansSoy SauceSpinachSweet potato Japanese regular TamariTempehTofuTomato Cherry Beefsteak Roma Thai BasilFind it an Sunnys, TNT, or most chinese grocery store. TumericWhite pepperYellow split Peas"},{"title":"","date":"2018-11-15T02:02:08.701Z","updated":"2018-11-15T02:02:08.701Z","comments":true,"path":"ingredients/index/index.html","permalink":"https://www.lakeisha.ca/ingredients/index/index.html","excerpt":"","text":""}],"posts":[{"title":"Maple tahini Dressing","slug":"mapletahini","date":"2020-03-28T02:57:00.000Z","updated":"2020-03-27T19:35:07.992Z","comments":true,"path":"maple-tahini-dressing/","link":"","permalink":"https://www.lakeisha.ca/maple-tahini-dressing/","excerpt":"","text":"Oil free salad dresing Servings: 1 big saladPrep-time: 2 minutes Recipe 2 tbsp tahini 2 tbsp soy sauce 1 tbsp maple syrup 1 tbsp apple cider vinegar Method Mix it all up in a bowl","categories":[],"tags":[{"name":"Salad","slug":"Salad","permalink":"https://www.lakeisha.ca/tags/Salad/"},{"name":"Oil free","slug":"Oil-free","permalink":"https://www.lakeisha.ca/tags/Oil-free/"}]},{"title":"Gnocchi","slug":"gnocci","date":"2019-11-20T05:00:00.000Z","updated":"2020-03-27T12:26:49.033Z","comments":true,"path":"gnocchi/","link":"","permalink":"https://www.lakeisha.ca/gnocchi/","excerpt":"","text":"Comforting potato gnocchis in savory classic Italian marinara &lt;3 Servings: 4 servingsPrep-time: 30 minCook time: 15 min per pizza Recipecoming soon- Method Boil 4 potatoes until they are soft enough for you to stick your fork inthem. Then remove them and carefully peel the skin away. Add the flour and combine well until you form a dough ball. Add more flour ifneeded for the dough ball to not be too sticky. Let it sit for 10 minutes covered. Split the dough into 4 balls, and roll each one into a long piece. Cut intognocchi sizes are however you prefer. From experience, lean towards the smallerside as they will expand. You can use a gnocchi roller or a fork to get that nice design on them. At this point the gnocchis are ready to cook, but I usually start the sauce now","categories":[],"tags":[{"name":"Italian","slug":"Italian","permalink":"https://www.lakeisha.ca/tags/Italian/"},{"name":"Comfort Food","slug":"Comfort-Food","permalink":"https://www.lakeisha.ca/tags/Comfort-Food/"}]},{"title":"Thai curry noodles","slug":"thaicurrynoodles","date":"2019-11-12T02:57:00.000Z","updated":"2019-11-11T05:14:20.144Z","comments":true,"path":"thai-curry-noodles/","link":"","permalink":"https://www.lakeisha.ca/thai-curry-noodles/","excerpt":"","text":"Servings: 4 large portionsPrep-time:Cook time: Recipe 2 cans of coconut milk 🌴 1/4 - 1/2 cup of my homemade Thai curry paste, or use less for store bought in most cases 1 tablespoon avocado oil or other high heat oil 1 pack of 2 rice noodles, medium thickness, both blocks in the pack 1 pack bean sprouts or about 2 cups 2 packs double frozen tofu 1 tablespoon chicken style broth (vegan) or vegetable broth 2 Japanese sweet potato 1 pack Thai basil 1 lime coconut/palm sugar to taste salt/tamari to taste Method Soak the rice noddles in room temperature water until later when they will be added. Defrost the double frozen tofu. Press the tofu, then soak in the broth. Bakeon stone at about 400F for 45 minutes. let it get golden brown and it shouldcome off the stone easier. Dice medium to small cubes of Japanese Sweet potato. Bake at 400F for about 45 minutes as well. Pick all leaves off Thai basil stems and wash leaves. Keep the flowers too Fry the curry paste in the oil ~5 minutes Add the coconut milk and simmer. Add half the Thai basil. Add the palm sugar, tamari, and lime juice to taste. Add the rice noodles. I like my noodles swimming in sauce a bit, so I add a bit of water. Cook noodles to desired softness. Turn off heat, immediately add bean sprouts, tofu, sweet potato, and remaining Thai basil, Serve with vegan hoisin sauce or hot chilli flakes or crushed peanuts","categories":[],"tags":[{"name":"Thai","slug":"Thai","permalink":"https://www.lakeisha.ca/tags/Thai/"},{"name":"Spicy","slug":"Spicy","permalink":"https://www.lakeisha.ca/tags/Spicy/"}]},{"title":"","slug":"mushroomPasta","date":"2019-11-11T16:39:24.189Z","updated":"2019-11-11T16:39:24.189Z","comments":true,"path":"/","link":"","permalink":"https://www.lakeisha.ca/","excerpt":"","text":"","categories":[],"tags":[]},{"title":"Gajar Ka Halwa","slug":"gajarKaHalwa","date":"2019-10-29T21:20:00.000Z","updated":"2019-11-11T05:31:31.650Z","comments":true,"path":"gajar-ka-halwa/","link":"","permalink":"https://www.lakeisha.ca/gajar-ka-halwa/","excerpt":"","text":"A sweet Indian dessert made from carrots that is actually healthy! Servings : 4-8 depending on serving sizePrep-time : 30 minCook time : 30 minTotal time : 60 min Recipe 4 cups shredded carrot(thickest organic carrots you can find) 🥕 4 cups almond milk 🥛 12 cashews or 18g of cashews 👠 4 dates 💕 crushed seeds of 6 green cardamom 💚 1 tsp peanut oil (optional) 🥜 Method Peel and grate the carrots. I use my blender to speed this up and also sinceI don’t have a large grater. You’ll see here roughly how large I chunk it sothat my blender can handle it. Here you can see my blender is not so wide on the bottom so I do smallbatches so that my blender can handle it. If you have a food processor, that maybe better. You are looking to get a shredded consistency, so don’t blend toolong and blend on low speed. Here is the result 😍 If you are using oil, add it to your wok or similar large pot. Add theshredded carrots and fry for a few minutes. Else, just add the shredded carrots Now add all the almond milk and bring to high heat. You will be reducing itdown now for quite some time, until the mixture is not liquid anymore basically.During this time you will also prep the final ingredients. Crush your green cardamom to get the seeds out and crush them into powderusing the mortar pestle. The fragrance from these whole spices are amazing! Youcan use pre-ground powder as well but you should double up then because it isnot as strong as freshly ground. Check on your mixture make sure its not sticking, perhaps reduce to mediumheat and let it simmer. Now soak your cashews and dates in hot water for 20minutes. You can then blend it into a nice smooth paste 😍 This is roughly what the texture should be like. No more liquid. So far frommy experience, the vegan version doesn’t stay orange perhaps due to thealmond milk and cashews – but I assure you it will taste amazing! I prefer my halwa nottoo sweet so that I can eat more of it, so 4 dates is good for me, but if youprefer sweeter, just add more dates or sugar or agave ect. You may also liketo add a pinch of salt. Serve with nuts and dried fruit of your choice :)","categories":[],"tags":[{"name":"Indian","slug":"Indian","permalink":"https://www.lakeisha.ca/tags/Indian/"},{"name":"Dessert","slug":"Dessert","permalink":"https://www.lakeisha.ca/tags/Dessert/"},{"name":"Sweet","slug":"Sweet","permalink":"https://www.lakeisha.ca/tags/Sweet/"}]},{"title":"Peri Peri Sauce","slug":"PeriPeri","date":"2019-10-09T02:57:00.000Z","updated":"2019-10-09T02:45:52.325Z","comments":true,"path":"peri-peri-sauce/","link":"","permalink":"https://www.lakeisha.ca/peri-peri-sauce/","excerpt":"","text":"A spicy tangy sauce that goes great on so many things Servings: Almost a Liter of saucePrep-time: 10 minsCook time: 30 mins Recipe 3 Red Bell Pepper 🔔 5 Peri Peri Peppers or Thai Bird Chillies 🌶 Zest of 1 small Lemon 🍋 Juice of 2 small Lemons 🍋 1 teaspoon Sage 👵 1 teaspoon Paprika 1 teaspoon Oregano 1 teaspoon Black Pepper 0.5 teaspoon Pink Salt 0.25 cup White Wine Vinegar 🍷 0.25 cup Grape seed oil or Olive oil (will test this oil free in future) 🍇 1 red Onion 3 cloves Garlic 1 tablespoon coconut sugar 🌴 or agave syrup (I’m going to try this with Dates next time, will let you know how it goes) MethodPerform in this order for max efficiency: Get your Oven first to start preheating @390F. If you have a fire oven, even better! Chop your Red Bell Peppers in half and deseed them. Cut the stem off yourPeri Peri /Bird chillies and leave the seeds. 5 chillies may seem like its gonnabe hot but its really not that bad. If you have really low tolerance, deseed afew. But I mean, its hot sauce after all. Place the hot peppers and Bell peppersskin up on a pizza stone or baking sheet and get them in the oven for about 30minutes. Let them get a little black on the outside, we will be removing theskin anyways. Chop your onions and garlic. Doesn’t have to be super fine, we will blend itlater anyways. Fry it in a table spoon of the oil(remove this from the 0.25 cup allocation), adding garlic second since itbrowns faster. Don’t let the garlic get brown. Then add it to your blender, including the oil. Get the rest of the ingredients into the Blender. My trick for squeezinglemons is to squeeze it right into the palm of your hand to catch the seeds, andlet the juice run through your fingers. No need for useless extra lemon squeezertaking up space in your drawer! Get fresh herbs if you can! Good ingredients arekey to good tasting food. I made it with dried spices though and it still tastedgreat. When the Bell peppers are getting black you will see the skin separating aswell! Remove the peppers from the oven and place on a chopping board to make it easyto scrape the skin off. Do this because a) its bitter, b) allows you to get thatroasted flavor of the pepper without the cancerous carbon. Add the pepper flesh into the blender Blend on high until everything is smooth. Now put that shit on everything! 🌶 😜 Heres some double frozen tofu! that i baked with the Peri Peri sauce. It was as amazing as it looks! I’ve also used it in a stir fry, and even on plain lentils to spice it up. Recipe adapted from Gaz’s","categories":[],"tags":[{"name":"Spicy","slug":"Spicy","permalink":"https://www.lakeisha.ca/tags/Spicy/"},{"name":"South African","slug":"South-African","permalink":"https://www.lakeisha.ca/tags/South-African/"},{"name":"Portuguese","slug":"Portuguese","permalink":"https://www.lakeisha.ca/tags/Portuguese/"},{"name":"Sauce","slug":"Sauce","permalink":"https://www.lakeisha.ca/tags/Sauce/"}]},{"title":"Double frozen Tofu","slug":"Doublefrozentofu","date":"2019-09-13T04:16:00.000Z","updated":"2019-10-09T02:37:21.582Z","comments":true,"path":"double-frozen-tofu/","link":"","permalink":"https://www.lakeisha.ca/double-frozen-tofu/","excerpt":"","text":"The best way to make tofu. You haven’t discovered tofu until you try this, straight up 💯 Servings: 2 (depends on brand of tofu that you buy and how hungry you are 🤣 )Prep-time: 25 minsFreeze time: 8 hoursThaw time: 10 hours By freezing the tofu, you change the structure of it! It allows you to press outmuch more water, which means the tofu can now act like a sponge and absorb anyflavors you want!! Recipe 1 package medium tofu Method Freeze the tofu. right in the package it comes in. Thaw the tofu. I find it takes about 5 hours, but depends on your room temperature. Freeze it again! Thaw it again when you are ready to use it. I like to keep to a bunch of tofupacks that were frozen and thawed once in the freeze so they are ready to gowhen i want tofu! Its also a good idea to use a sharpie on them so you can keeptrack of how many times they’ve been frozen(I buy a lot and am starting to getthem mixed up) You can also use the thaw function on your microwave if you dont have time towait. Open the tofu pack and drain the water. Press the tofu. I like to slice holes in the plastic container and press thetofu directly in its package, the holes allow the water to drain instantly. Andthe package help prevent the tofu from breaking. Once most the water ispressed, i take it out and press it further with myhands, carefully not to break the tofu. Slice you tofu into cubes, or whatever you want. For chicken pieces style,rip it into pieces, allowing it to rip naturally in the cracks that it has. Season your tofu. Some suggestions below! Paneer style 2 tablespoon nutritional yeast 1 teaspoon white pepper water Add all ingredients and enough water to form some liquid, roughly equal to the volume of your tofu. take each piece of tofu and dip it in your liquid seasoning. Careful not to break it. roll the soaked tofu in some flour. Add all coated tofu pieces to a pizza stone or baking sheet and bake at 400F for 30-40 minutes Chicken style Vegetarian/vegan Chicken style broth, find it at bulk barn. Water Same as above. Make your liquid and dip the pieces. Roll in flour if desired. Add all coated tofu pieces to a pizza stone or baking sheet and bake at 400F for 30-40 minutes FriedThis picture shows me frying it in various experimental seasonings 🤤","categories":[],"tags":[{"name":"Protein","slug":"Protein","permalink":"https://www.lakeisha.ca/tags/Protein/"}]},{"title":"Next Next Level Enchiladas","slug":"Enchiladas","date":"2019-08-20T05:00:00.000Z","updated":"2019-11-03T19:57:15.165Z","comments":true,"path":"next-next-level-enchiladas/","link":"","permalink":"https://www.lakeisha.ca/next-next-level-enchiladas/","excerpt":"","text":"Oil free version based on recipe by Oh She Glows. Link for ref at the bottom. Servings: 5-6 EnchiladasPrep-time: 30 minCook time: 30 min RecipeEnchilada Sauce 1.5 cup veg broth 1 can tomato paste (5.5 oz) 2 tbsp flour 1 teaspoon garlic powder 1 teaspoon cumin 0.5 teaspoon onion powder 0.5 teaspoon salt 1.5 teaspoon chilli powder 1/4 teaspoon cayenne pepper– or – 2 teaspoon adobo pepper sauce Enchiladas 1 large red onion 1 large sweet potato 1-3 cups spinach chopped. find a place that sells it loose(no plastic container), like whole foods or Sunny’s. Cheaper and better for Earth. 2-4 adobo peppers 2 garlic 1 cup black beans handful sundried tomatoes (not in oil - i find these at whole foods) 5-6 tortilla wraps. @Wholefoods has some really good vegan ones like spinach or sun-dried tomato Avocado Cream (optional) 3/4 cup raw cashews 1/2 cup fresh cilantro leaves 1 large garlic clove 1/2 cup water, or as needed 3 tablespoons fresh lime juice 2 tablespoons avocado 1/2 teaspoon fine sea salt 1/2 teaspoon garlic powder Method Chop the sweet potato into small cubes and put the on a pizza stone(no oil) and bake @420 F for ~30 minutes. If you dont have a pizza stone, try parchment paper or maybe resort to a bit of oil. If you have an instant pot or pressure cooker, get your black beans ready too. I usually do 30 minutes from dry in the insta. You can use canned otherwise. Get started with the sauce. Get the broth in your pot and put it on medium to low heat. Add all the other ingredients and cook for 5-10 minutes until everything is mixed well. Salt to taste and turn off heat. Add the chopped onion,spinach, garlic and adobo peppers to a wok or large pot and cook on medium to low until onions are to your liking. The Sweet potato and black beans should be about done by now. Add these and the rest on the ingredients and cook another 3-5 minutes. Spread a layer of your enchilada sauce on the bottom of a deep baking dish. Put a scoop of filling on each enchilada and roll them up. Get them in the dish and pour the remaining sauce on them. Bake at 350 for 30 mins. If you are doing the avocado cream, now is the time. Soak the cashews in hot water for at least 15 minutes up to an hour. Put all ingredients in a blender and blend long time till smooth. Damn, my mouth is watering just after writing this recipe down. Its really notthat much work and is super comforting food and super healthy too. Also, thisdish does really well as leftovers, some people might even prefer it reheated.So its a great meal prep candidate. Good way to get that spinach too. I startedusing the whole bunch of spinach in an effort not to let anything go bad and toget more vitamins - and it still taste great! The spinach wilts down a lotanyways, so 1 cup isn’t that much, which is what the original recipe called for. you can bake it without the sauce to get it cripsier and add the sauce after and then bake a lil more. https://ohsheglows.com/2016/02/01/next-level-vegan-enchiladas/","categories":[],"tags":[{"name":"Mexican","slug":"Mexican","permalink":"https://www.lakeisha.ca/tags/Mexican/"},{"name":"Leftovers","slug":"Leftovers","permalink":"https://www.lakeisha.ca/tags/Leftovers/"}]},{"title":"Bagi","slug":"bagi","date":"2019-07-07T05:00:00.000Z","updated":"2019-11-11T05:15:40.438Z","comments":true,"path":"bagi/","link":"","permalink":"https://www.lakeisha.ca/bagi/","excerpt":"","text":"Carribean greens recipe. Updated recipe coming soon. Servings:Prep-time: 30 minCook time: 15 min per pizza Recipe1 bag mustard greens1 bag bok choy or similar1/2 yellow onion3 garlic1-2 wiri wiri2 teaspoon coconut cream1 teaspoon salt to taste1 teaspoon oil Method Fry the onion garlic and pepper in the oil or water fry it. Add all of the greens. Have them chopped fine. Cook down on medium heat Once greens are reduced, add coconut cream and salt serve with rice or roti","categories":[],"tags":[{"name":"Caribbean","slug":"Caribbean","permalink":"https://www.lakeisha.ca/tags/Caribbean/"}]},{"title":"Shahi Curry","slug":"shahicurry","date":"2019-06-30T09:40:00.000Z","updated":"2019-11-03T20:08:03.818Z","comments":true,"path":"shahi-curry/","link":"","permalink":"https://www.lakeisha.ca/shahi-curry/","excerpt":"","text":"Tomato based curry using whole spices and cashews Servings: 4Prep-time: 30 minCook time: 30 min RecipeThis recipe is mainly for the sauce. The options for what veg and protein to addto it are up to you! Traditionally, I would say a paneer style seasoning on tofuis the classic, but I find it works great for Aloo Gobi(potatoes and cauliflower) too. Part 1 IngredientsYour choice in any combination: Cauliflower Potatoes Tofu - checkout my other recipe for double frozen frozen tofu paneer style! Chickpeas Or whatever else you like in your curry! Part 2 ingredients: 6 tomatoes or 1 can tomato paste 1/4 cup cashews 1 red onion 1 green cardamom pod 1 stick of cinnamon 1 Bay leaf 1/2 cup water 1 tea spoon salt Part 2 ingredients: 2 cloves garlic 1 table spoon methi 3 deseeded chillis 1 table spoon peanut oil Method If you choose to add tofu, cauliflower or potatoes, I’d recommend using the oven and getting that going first.I like to bake potatoes and cauliflower on a pizza stone for this recipe @400 F for about 40 minutes. Add all of the part 2 ingredients to a pot and bring to boil. Then let it simmer on medium. If serving with rice, now’s a good time to get your rice cooker going. Ifserving with Roti, i’d prep the dough now and cook them at the very end justbefore serving. Chop and fry the third ingredients, adding the garlic last. Turn to low when garlic is cooked. Back to the boiling ingredients. They should be about done by now. When thecashews are soft, blend the mixture, removing the bayleafs first Remove the fryed ingredients from heat or add some water and add the mixtureto it(prevent mixtures from splashing and bubbling). Add back to heat and addthe pototes, cauliflower, tofu or other. Cook down or add water for desiredconsistency. Salt and pepper to taste. And heres the nutritional info, assuming served with paneer style tofuTo do your own nutrional tracking, checkout chronometer","categories":[],"tags":[{"name":"Indian","slug":"Indian","permalink":"https://www.lakeisha.ca/tags/Indian/"}]},{"title":"Pad Thai","slug":"padthai","date":"2019-04-02T05:00:00.000Z","updated":"2019-10-09T01:32:23.059Z","comments":true,"path":"pad-thai/","link":"","permalink":"https://www.lakeisha.ca/pad-thai/","excerpt":"","text":"Recipe Coming soon Servings:Prep-time:Cook time: Recipe- Method","categories":[],"tags":[{"name":"Thai","slug":"Thai","permalink":"https://www.lakeisha.ca/tags/Thai/"},{"name":"Spicy","slug":"Spicy","permalink":"https://www.lakeisha.ca/tags/Spicy/"}]},{"title":"General Tofu","slug":"generalTofu","date":"2019-03-26T05:00:00.000Z","updated":"2019-11-11T05:24:41.724Z","comments":true,"path":"general-tofu/","link":"","permalink":"https://www.lakeisha.ca/general-tofu/","excerpt":"","text":"Recipe coming soon Servings:Prep-time:Cook time: RecipeMethod Defrost double frozen tofu. Press out water and soak in chicken style veganbroth. Coat in seasoning. I find that if i press on it a bit on each side, i canmake the broth ooze out a lil and help to absorb some more seasoning onto thecoating. Bake on well oiled stone or pan at 400F for about 40 minutes. Chop red onion, garlic, bell peppers. rest coming soon","categories":[],"tags":[{"name":"comfort","slug":"comfort","permalink":"https://www.lakeisha.ca/tags/comfort/"},{"name":"Asian","slug":"Asian","permalink":"https://www.lakeisha.ca/tags/Asian/"},{"name":"tofu","slug":"tofu","permalink":"https://www.lakeisha.ca/tags/tofu/"}]},{"title":"......Sushi","slug":"sushi","date":"2019-03-07T05:00:00.000Z","updated":"2019-07-06T17:31:33.459Z","comments":true,"path":"sushi/","link":"","permalink":"https://www.lakeisha.ca/sushi/","excerpt":"","text":"Avocado, cucumber, cripsy tofu, teryaki :p Servings:Prep-time: 30 minCook time: 15 min per pizza Recipe- Method1.","categories":[],"tags":[{"name":"Rice","slug":"Rice","permalink":"https://www.lakeisha.ca/tags/Rice/"},{"name":"Asian","slug":"Asian","permalink":"https://www.lakeisha.ca/tags/Asian/"}]},{"title":"Chickpea Coconut Curry","slug":"chickpeacurry","date":"2019-01-10T05:00:00.000Z","updated":"2019-10-09T01:30:37.943Z","comments":true,"path":"chickpea-coconut-curry/","link":"","permalink":"https://www.lakeisha.ca/chickpea-coconut-curry/","excerpt":"","text":"Recipe coming soon Servings: 1-4 medium thin-crust pizzasPrep-time: 30 minCook time: 15 min per pizza Recipe- Method1.","categories":[],"tags":[{"name":"Indian","slug":"Indian","permalink":"https://www.lakeisha.ca/tags/Indian/"},{"name":"Curry","slug":"Curry","permalink":"https://www.lakeisha.ca/tags/Curry/"}]},{"title":"Mac","slug":"Mac","date":"2018-12-29T05:00:00.000Z","updated":"2019-09-17T03:07:57.944Z","comments":true,"path":"mac/","link":"","permalink":"https://www.lakeisha.ca/mac/","excerpt":"","text":"Cashew and nooch based mac sauce with broccoli and mushrooms Servings: 4Prep-time: 20 minCook time: 20 min Note: I double the recipe in this photo RecipeBoiling ingredients 1/4 cup cashews 1 peeled Yukon gold potato 🥔 1/4 cup carrots 🥕 1/3 cup onion 1 clove of garlic Blender ingredients 1 teaspoon pink salt (or regular salt) 1/4 cup coconut milk(from a can so its got that cream) 🥥Note: with the extra coconut milk i like to make overnight oats/ chia seed pudding 1 table spoon lemon juice, or roughly half a small lemon. 🍋 3 tablespoons nutritional yeast(nooch) 🧀 pinch cayenne pepper(optional) 🌶 pinch paprika(optional) And the other ingredients 1 medium head of broccoli 🥦 one package(about 2 cups) mushrooms 🍄 of your choice 2 table spoons taco 🌮 seasoning 250 grams of your fave pasta noodle 🌽 (mine is fusilli). I usually use dried100% durum wheat noodles which are simple to cook, but feel free to use glutenfree. Method Place all boiling ingredients in a medium to large pot and add enough waterjust to cover them. Bring to a boil and reduce to medium heat to simmer forabout 20 minutes or until potato is soft. Move on to next steps during this time.Note: this picture is from my first time doing it, so excuse the extra potatoand lack on onion and garlic Chop your broccoli into small pieces and place in a strainer over yourboiling ingredients to steam it. 🚂 Rinse your pasta noodles and cook in ‘salty like the sea’ water until desiredsoftness. 🍝 Chop your mushrooms and put them in a pan with medium heat tocook. Season with taco style seasoning or whatever else you like. Mushroomstaste great on their own, just some salt might be good for you or if you don’thave the taco seasoning. Oil to fry them in is optional, I find mushrooms don’treally stick to the pan so I skip the oil since its actually not a health food. When potatoes are soft, the boiling ingredients are ready to be blended. Addthe Blending ingredients as well. Blend on high for a good couple minutes toget a smooth texture. Smooth and Shiny ✨ Now add everything together! More salt and nooch to taste. Feel free to mix it up! Use what ever veg you like. NakedWith extra nooch and black pepper With chilli flakes With home grown arugula sprouts 🌱 NOM NOM Recipe adapted from https://veganyumminess.com/creamy-vegan-mac-and-cheese/","categories":[],"tags":[{"name":"Comfort","slug":"Comfort","permalink":"https://www.lakeisha.ca/tags/Comfort/"},{"name":"Cheese Alternative","slug":"Cheese-Alternative","permalink":"https://www.lakeisha.ca/tags/Cheese-Alternative/"}]},{"title":"Oatmeal","slug":"oatmeal","date":"2018-11-15T05:00:00.000Z","updated":"2019-08-21T02:38:20.535Z","comments":true,"path":"oatmeal/","link":"","permalink":"https://www.lakeisha.ca/oatmeal/","excerpt":"","text":"Servings: 1-4 medium thin-crust pizzasPrep-time: 30 minCook time: 15 min per pizza Recipe1 cup oat milk1 cup oats1 apple in bite size pieces1 teaspoon cinnamon2 large dates1 scoop almond butter other toppings like toasted coconut, hemp seeds etc - Method boil the apple and dates first. mash and dissolve the date into the milk with your spoon. turn off the heat and add the oats, cinnamon, nutmeg, pumpkin spice, etc adjust thickness with more oats or toppings","categories":[],"tags":[{"name":"Breakfast","slug":"Breakfast","permalink":"https://www.lakeisha.ca/tags/Breakfast/"}]},{"title":"Banana Ice Cream","slug":"BananaIceCream","date":"2018-11-15T04:11:00.000Z","updated":"2019-11-03T19:58:14.318Z","comments":true,"path":"banana-ice-cream/","link":"","permalink":"https://www.lakeisha.ca/banana-ice-cream/","excerpt":"","text":"Creamy scoopable 🥥 🍌 ice cream! Recipe 1 can chilled coconut milk or coconut cream 🥥 1 very ripe banana 🍌 1 table spoon agave syrup 1 table spoon corn syrup 1 table spoon white sugar 1 teaspoon vanilla 1 teaspoon xanathan gum Method Make sure the coconut milk can has been in a cold fridge (or near the back) for at least a day. Open the can and scoop off the cream which has solidified and risen above the water. Add to a bowl Do not add the coconut water at the bottom of the can, use it for something else like chia pudding! Add the sugar, agave, corn syrup, vanilla. Heat the ingredients using a double bowl technique. This will remove clumps in the coconut cream. Add to the blender, add the banana and blend until smooth, pour into freezable bowl. Freeze for 2 hours, then take out and stir. Freeze for another half hour then take out and stir. Freeze for another half hour then take out and stir. Freeze for another half hour then take out and stir. Freeze for another half hour then take out and stir. Enjoy!! Notes Xanathan gum can be found at freshco or online. I have the one from Bob’s mill brand. Agave Syrup can be found in most high end grocery stores now like Loblaws, Sobeys, Whole Foods etc For the Coconut milk, I recommend the Aroy-D brand, the one in green can.","categories":[],"tags":[{"name":"Dessert","slug":"Dessert","permalink":"https://www.lakeisha.ca/tags/Dessert/"}]},{"title":"Daal","slug":"Daal","date":"2018-11-15T02:57:00.000Z","updated":"2019-11-04T17:27:19.333Z","comments":true,"path":"daal/","link":"","permalink":"https://www.lakeisha.ca/daal/","excerpt":"","text":"Yellow split pea Daal with roasted garlic &amp; cumin seeds, goes great with rice! Recipe 1 cup yellow split peas lots of water half a medium onion or 2 shallots 2 garlic cloves whole 2 garlic cloves minced 1-2 hot cherry pepper or wiri wiri 0.5 teaspoon turmeric 0.5 teaspoon Lalah’s curry powder or similar 1 tablespoon peanut oil 1 tablespoon cumin seeds 1 teaspoon salt and then to taste MethodWith a pressure cooker: Wash split peas. Add all ingredients to the pressure cooker except the oil cumin seeds and minced garlic, and put it to cook on high for 50 minutes Blend the mixture using daal gutney or blender. Fry the cumin seeds in the peanut oil, then add the garlic. Add the fry to the mixture. salt to taste Without a pressure cooker: Perform the steps in this order for maximum efficiency: Part 1 Add about 6 cups or half pot of water and put on high heat. (10 seconds) Wash your split peas until water is clear, add to pot. (1 min ) Remove skin from garlic of 3 cloves and toss in whole. Also add the onion and hot pepper whole. (1 min) Add the curry powder and 2 teaspoon salt. ( 30s) Mince the 5 garlic (2 min) Let boil and continue to top up with water for 1 hour. Might need to turn heath down to 7/10 if boiling over. ~ make other food ~ Part 2 Use a Dhal gutney or electric hand blender to break down further the split peas. Heat the oil in separate pan and add cumin seeds. Once they are getting dark brown, add the garlic. Cumin seeds may be black. Fry the garlic and let it get light brown. Then pour all oil, seeds and garlic into the pot. Continue to boil down and add water until desired split pea consistency is reached. It should be very smooth like a squash soup.You can make it thick and serve on its own or with rice, or thin(add more water) and use it as a soup broth Boil down to final desired water content and turn off heat. Salt to taste and done!sometimes i like to drink it out of a cupLalah’s curry powder: find it at Bestco or grocery with Caribbean items.","categories":[],"tags":[{"name":"West Indian","slug":"West-Indian","permalink":"https://www.lakeisha.ca/tags/West-Indian/"},{"name":"Indian","slug":"Indian","permalink":"https://www.lakeisha.ca/tags/Indian/"},{"name":"Daal","slug":"Daal","permalink":"https://www.lakeisha.ca/tags/Daal/"},{"name":"Rice","slug":"Rice","permalink":"https://www.lakeisha.ca/tags/Rice/"}]},{"title":"Roti","slug":"roti","date":"2018-11-15T02:57:00.000Z","updated":"2019-07-06T18:03:22.511Z","comments":true,"path":"roti/","link":"","permalink":"https://www.lakeisha.ca/roti/","excerpt":"","text":"Servings: 1-4 medium thin-crust pizzasPrep-time: 30 minCook time: 15 min per pizza Recipe- Method1.","categories":[],"tags":[{"name":"Thai","slug":"Thai","permalink":"https://www.lakeisha.ca/tags/Thai/"},{"name":"Spicy","slug":"Spicy","permalink":"https://www.lakeisha.ca/tags/Spicy/"}]},{"title":"Pesto Pasta","slug":"pestopasta","date":"2018-11-15T02:57:00.000Z","updated":"2019-10-09T01:32:47.784Z","comments":true,"path":"pesto-pasta/","link":"","permalink":"https://www.lakeisha.ca/pesto-pasta/","excerpt":"","text":"Recipe coming soon Servings: 1-4 medium thin-crust pizzasPrep-time: 30 minCook time: 15 min per pizza Recipe- Method1.","categories":[],"tags":[{"name":"Thai","slug":"Thai","permalink":"https://www.lakeisha.ca/tags/Thai/"},{"name":"Spicy","slug":"Spicy","permalink":"https://www.lakeisha.ca/tags/Spicy/"}]},{"title":"Scrambled Tofu","slug":"ScrambledTofu","date":"2018-11-03T16:17:00.000Z","updated":"2019-11-03T20:00:38.744Z","comments":true,"path":"scrambled-tofu/","link":"","permalink":"https://www.lakeisha.ca/scrambled-tofu/","excerpt":"","text":"Hearty and simple yet Flavourful Scrambled Tofu! This dish is so delicious and comforting! Its packed with protein, no LDL cholesterol, and Tofu has a much longer expiry date than eggs, so its easy to keep theingredients on hand! Recipe Medium size onion 4 garlic cloves 1 tablespoon avocado oil or other high smoke point oil 3/4 package of firm tofu one of your best tomatoes 1 teaspoon ground turmeric 1 teaspoon ground Cumin 1 teaspoon Salt 1/2 teaspoon ground Thyme half a Thai bird chili (optional) Method ~ Prep the vegetables ~ Dice your onion and tomato, mince your garlic. If you are using hot pepper, chop that up too. Add the oil to your pan. Set stove to high to get oil heated quickly, then bring it back down to 4/10 Add in the onion. Fry until translucent Then add in the garlic. Fry for another minute or until fragrant. Do not let in get brown. Add in the tomato. Add the whole thing, not to loose any juices.If you have frozen tomatoes, just microwave on a plate for 4 minutes.Then mash it down with a potato masher or something. Add the chili pepper now as well if using. Add the Salt, black pepper, Cumin and Thyme. Start crumbling in your tofu. Sprinkle the Turmeric powder over the tofu now to give it that color Mix everything down and cook for a couple more minutes, until all liquid is absorbed/evaporated. salt and pepper to taste. ~Its done!~","categories":[],"tags":[{"name":"breakfast","slug":"breakfast","permalink":"https://www.lakeisha.ca/tags/breakfast/"}]},{"title":"La Pizza","slug":"Pizza","date":"2018-10-29T05:00:00.000Z","updated":"2019-07-05T14:13:09.324Z","comments":true,"path":"la-pizza/","link":"","permalink":"https://www.lakeisha.ca/la-pizza/","excerpt":"","text":"ultra thin cripsy crust pizza !Servings 4 medium thin-crust pizzasPrep-time 30 minCook time 15 min per pizza The pizza dough is a standard recipe, but its the cooking technique that really makes this pizza stand out as one of my favorite personally developed recipes! It results in a super crispy thin crust! Why have 1 thick pizza when you can have 4 thin pizzas? Thats 4 times as many vegetables! Recipe ~ Dough ~ This is for one batch of dough which can make 4 thin crust pizzas 2 cups flour 1 cup water💦 8g yeast, or 1 pack fleishmans yeast🍞 teaspoon of sugar pinch of salt ~ Sauces ~ Option 1: Garlic and chili -&gt; This is for one pizza’s worth of sauce 2 TableSpoons Olive Oil 5 minced garlic cloves 1 cherry pepper or wiri wiri pepper🌶 Option 2: Pesto -&gt; makes a large portion of pesto sauce 2 cups packed basil leaves🍃 2 cloves garlic 1/4 cup pine nuts or walnuts 2/3 cup olive oil 3 table spoons plant parm or parmageddon or make your own plant parm using nutritional yeast(will figure this out in future) 1 teaspoon salt half teaspoon pepper Blend! Option 3: Passata base -&gt; This is one pizza’s worth 2 Table Spoons Olive Oil 4 Table Spoons Passata🥫 5 Minced Garlic Cloves half a medium sized onion, minced Method ~ Pre ~ Pre-Heat oven to 500F🌡. I would try with even hotter, but this is the highest my oven goes! If you are using any wet vegetables or mushrooms, Cut them up and place on a rack in the oven to dehydrateThis will help the pizza crust up properly! ~ Dough ~ Start with half a cup of tap-warm water, Add the yeast and sugar. Give a lil stir. The sugar is food for your yeast! If your yeast is not expired or dead, it will begin to foam up in about a minute or two. Let it sit for 8 more minutes. There should be a lot of foam! Add the flour, yeast water, and remaining half of cup water to a large bowl and mix. Cover the bowl with a cloth and let sit for another 20-30 minutes. During this waiting time, you can prep any vegetables Knead the risen dough another minute and that’s it, the hardest part of pizza is done. ~ Roll out and Decorate ~ *There are two ways I make the pizza. one is rolling the dough on parchment paper and cooking on a pizza stone, the other just uses a cast iron pan. Heres the secret rolling technique. Begin Rolling the dough flouring each side only initially. Then, continue rolling it out, but do not flip it. let the underside stick to the surface. Continue to apply flour to the top to prevent your rolling pin (or wine bottle) from sticking to it. This will allow you to get an ultra thin crust! Continue until you have reach a size slightly larger than your cast iron pan. Apply some olive oil to the pan. Be slightly generous. If using parchment paper, no need. Transfer the dough into the pan now. This could be tricky, and make sure not to burn yourself on the pan. It it falls apart, just get it all in there and press the dough back together. Roll the dough up the edges. If using parchment paper, just leave it on the paper and move the whole thing onto your stone after it is decorated (after steps 4,5,6) Spread your sauce over the dough. When using passata or pesto sauce, a generous amount helps keep vegetables in place. Add your vegetables! Put the wetter ones on the outside near the criust edge, so they will dry out faster. Bake in the oven for about 15 minutes, or until desured crust crunchiness. I use a long knife to lift up the crust as a test to see its rigidy. ~ Veg Ideas ~ Olives, tomatoes 🍅, oregano, red onions, mushrooms. 😍😍😍Thin Sweet potatoe slices🍠, Pineapple stuffed crust🍍, Green peppers. Thin potatoe slices, Artichoke hearts, broccoli, tomatoe slices, Arugula Basil Leaves🍃, Tomatoes slices 🍅, vegan feta 🧀","categories":[],"tags":[{"name":"Italian","slug":"Italian","permalink":"https://www.lakeisha.ca/tags/Italian/"},{"name":"comfort","slug":"comfort","permalink":"https://www.lakeisha.ca/tags/comfort/"}]},{"title":"Thai Curry paste","slug":"ThaiCurryPaste","date":"2018-10-29T05:00:00.000Z","updated":"2019-11-11T04:42:44.681Z","comments":true,"path":"thai-curry-paste/","link":"","permalink":"https://www.lakeisha.ca/thai-curry-paste/","excerpt":"","text":"Make your own spicy thai curry paste that will last for weeks in the fridge! This curry paste will resemble a Red Thai curry, but its color can vary depending on your pepper choice. RecipeEqual parts of: 50 g Galangal (never heard of it? pictures below) 50 g Fresh Turmeric 50 g Onion 50 g Garlic 50 g Lemongrass(optional) one Keffir Lime rind (or 2 keffir lime leaves if you cant find)(optional) 50 deseed dried red chillies 🌶 (sounds like a lot but trust me it wont be very spicy - you will deseed) 50 g Fresh Ginseng (optional. Hard to find so ive often omitted it. Try to find at TNT) 2 tablespoon Coriander seeds 1 tablespoon salt MethodWhen I make this, I try to make as much as possible! So I choose an ingredientsize that will fill my blender to the top. 50 grams of each ingredient fills myvitamix. You could cut the recipe in half if you want just enough paste for onerecipe. Cut the ingredients into small pieces so that they will blender easier,unless you have a beast of a blender! Place all ingredients except the coriander seeds into a large pot withenough water to almost cover the ingredients. Bring to boil on high for about 25minutes. Top up the water a bit if it all evaporates to prevent anything burning to the bottom. Get a small pan and roast the coriander seeds until brown but not black. Thenadd them to the mixture in the pot as well. (Do this early on, don’t wait the 25minutes to add this) Add everything to your blender and blend well! Try to get it blended to thepoint where there are no more strands of lemon grass fiber. Add a bit more waterif you need to help it blend. My blender comes with a plastic rod that Ijam into the blender while its going to push everything down and help it along.But since we boiled the ingredients, you should not have any issues. Store in fridge. Can last at least 3 weeks. GalangalThis one can be hard to find. Sometimes the TNT on Cherry Road has it, but the TNT in mississauaga is more a gaurantee. You can also try Sunny’s or Bestco or any other Chinese/Thai Grocery stores.The taste is quite different than Ginger. Its more sweet and bitter rather than spicy like ginger. It can also be called Thai Ginger.","categories":[],"tags":[{"name":"thai","slug":"thai","permalink":"https://www.lakeisha.ca/tags/thai/"},{"name":"curry","slug":"curry","permalink":"https://www.lakeisha.ca/tags/curry/"},{"name":"spicy","slug":"spicy","permalink":"https://www.lakeisha.ca/tags/spicy/"}]},{"title":"Thai Larb","slug":"ThaiLarb","date":"2018-10-28T05:00:00.000Z","updated":"2019-11-03T20:09:20.587Z","comments":true,"path":"thai-larb/","link":"","permalink":"https://www.lakeisha.ca/thai-larb/","excerpt":"","text":"This TVP based salad features Mint, Lime, Culantro, Agave, and hot peppers! Allow me to introduce you to Thai Larb! The mint and cullantro give it a wonderfully refreshing flavour. The hot peppers, agave syrup, soy sauce and broth round it out and pack in the flavour. TVP is used to get that ground protein-like texture! Recipe 2/3 cup TVP 1/2 cup water 💦 1/2 cube veg stock 2 teaspoon Tamari 2 teaspoon Agave Syrup🍯 1/2 cup Culantro leaves 1/2 cup mint leaves 1 Shallot 1 table spoon Toasted Sticky rice 1/2 hot cherry pepper 🍒🌶 1/2 Lime🍋 Prepare the Toasted Sticky Rice 🍚. Also known as Glutinous Rice. Fill a pan just enough to cover the entire surface. Put the stove on max heat and shake the pan while maintaining contact with the stove. Heat until golden brown! Add the wet ingredients to your wok and bring to a boil. Use a Spoon to crush the veg stock cube and dissolve. Add TVP and stir, give it a light fry on 5/10 heat. Turn off the heat and add the shallot, hot pepper 🌶 , Culantro and Mint leaves. Squeeze the lime into it, and taste. Adjust according to your likeing to balance the sweet(agave 🍯), salty(soy sauce), sour(🍋) and spicy(🌶) Scoop into your serving bowl, and top with toasted sticky rice. ~ สนุก ~","categories":[],"tags":[{"name":"thai","slug":"thai","permalink":"https://www.lakeisha.ca/tags/thai/"},{"name":"spicy","slug":"spicy","permalink":"https://www.lakeisha.ca/tags/spicy/"},{"name":"salad","slug":"salad","permalink":"https://www.lakeisha.ca/tags/salad/"}]},{"title":"Pumpkin Pie","slug":"PumpkinPie","date":"2018-09-23T05:00:00.000Z","updated":"2019-07-06T00:33:38.052Z","comments":true,"path":"pumpkin-pie/","link":"","permalink":"https://www.lakeisha.ca/pumpkin-pie/","excerpt":"","text":"Servings: 1-4 medium thin-crust pizzasPrep-time: 30 minCook time: 15 min per pizza Recipe- Method1.","categories":[],"tags":[{"name":"Thai","slug":"Thai","permalink":"https://www.lakeisha.ca/tags/Thai/"},{"name":"Spicy","slug":"Spicy","permalink":"https://www.lakeisha.ca/tags/Spicy/"}]},{"title":"Baigon Choka","slug":"baiganchoka","date":"2016-06-06T05:00:00.000Z","updated":"2019-08-21T02:36:59.743Z","comments":true,"path":"baigon-choka/","link":"","permalink":"https://www.lakeisha.ca/baigon-choka/","excerpt":"","text":"Roasted Eggplant and garlic and veg mash served with roti Servings: 4Prep-time: 10 minCook time: 45 min Recipe4 light purple (chinese) eggplant8 garlic3 green onion1/2 cup chopped tomatoessaltpepper Roti Method put garlic cloves in eggplant. (cut slits in eggplant) roast at 420C for 45mins skin should be dark and falling off. scrape out contents into bowl add green onions, tomatoes, salt, pepper, toss scoop up with roti and eat","categories":[],"tags":[{"name":"Caribbean","slug":"Caribbean","permalink":"https://www.lakeisha.ca/tags/Caribbean/"}]}]}