{"meta":{"title":"Lakeisha's Lab","subtitle":"Rediscover Vegetables","description":"Recipes from all cultures","author":"Lakeisha Pogrzeba","url":"https://www.lakeisha.ca"},"pages":[{"title":"about","date":"2018-11-02T19:00:38.000Z","updated":"2018-11-02T18:00:38.312Z","comments":true,"path":"about/index.html","permalink":"https://www.lakeisha.ca/about/index.html","excerpt":"","text":""}],"posts":[{"title":"Scrambled Tofu","slug":"Scrambled_Tofu","date":"2018-11-03T16:17:00.000Z","updated":"2018-11-03T15:45:16.562Z","comments":true,"path":"scrambled-tofu/","link":"","permalink":"https://www.lakeisha.ca/scrambled-tofu/","excerpt":"","text":"Hearty and simple yet Flavourful Scrambled Tofu! This dish is so delicious, I promise you will prefer it over scrambled eggsIt also has more protein, no LDL cholesterol, and Tofu has a much longer expiry date, so its easy to keep theingredients on hand! Recipe Medium size onion 4 garlic cloves 1 tablespoon avocodo oil or other high smoke point oil 3/4 package of firm tofu one of your best tomatoes 1 teaspoon ground tumeric 1 teaspoon ground Cumin 1 teaspoon Salt 1/2 teaspoon ground Thyme half a thai bird chilli (optional) Dice your onion and tomatoe, and mince your garlic (and chilli if using)The reason i recommned a good tomatoe, is that I find this is one of the vegetables whereorganic or better yet homegrown, makes a huge differenceAdd the oil. Set stove to high to get oil heated quickly, then bring it back down to 4/10If your oil smokes(perhaps you are using olive or veg oil) throw it out and start againAdd in your onion first. Fry for a few min, then add in the garlic. Fry for another minute.Add in the tomatoe. I add the whole thing, skin and all. I chop it in hand over a plate, as to not loose any juices to my wooden cutting boardIf you have frozen tomatoes, just microwave on a plate for 4 minutes and do the sameAdd the chilli pepper now as well if using. I just use half since i dont want to overpower the other flavours, but if you are in the mood for it, add the whole thing! or maybe 2 chillies!While you are letting it cook down for a few minutes, you can start adding the spicesAdd the Salt, black pepper, Cumin and Thyme.Then, start crumbling in your tofu.Sprinkle the Tumeric powder over the tofu now to give it that color(and also its anti-inflamatory and anti-oxidant properties!)Mix everything down and cook for a couple more minutes, until all tomatoe juice is absorbed/evaporated Its done! Well, it probably is, but do a taste test, and adjust the salt or spices to your liking","categories":[],"tags":[{"name":"breakfast","slug":"breakfast","permalink":"https://www.lakeisha.ca/tags/breakfast/"}]},{"title":"Enchiladas","slug":"Enchiladas","date":"2018-11-01T05:00:00.000Z","updated":"2018-11-03T15:51:57.400Z","comments":true,"path":"enchiladas/","link":"","permalink":"https://www.lakeisha.ca/enchiladas/","excerpt":"","text":"","categories":[],"tags":[]},{"title":"La Pizza","slug":"Pizza","date":"2018-10-29T05:00:00.000Z","updated":"2018-11-03T16:36:09.143Z","comments":true,"path":"la-pizza/","link":"","permalink":"https://www.lakeisha.ca/la-pizza/","excerpt":"","text":"La PizzaWhy didnt i tag this as a dinner food? Becuase I could (and do) eat it for breakfast lunch and dinner! I use fleishmans yeast","categories":[],"tags":[{"name":"italian","slug":"italian","permalink":"https://www.lakeisha.ca/tags/italian/"},{"name":"comfort","slug":"comfort","permalink":"https://www.lakeisha.ca/tags/comfort/"}]},{"title":"Thai Larb","slug":"thai-larb","date":"2018-10-28T05:00:00.000Z","updated":"2018-11-03T15:51:47.891Z","comments":true,"path":"thai-larb/","link":"","permalink":"https://www.lakeisha.ca/thai-larb/","excerpt":"","text":"This TVP based salad features Mint, Lime, Culantro, Agave, and hot peppers! It is the lesser known Thai Larb! The mint and cullantro give ita wonderfully refreshing flavour. The hot peppers, agave syrup,soy sauce and broth round it out and pack in the flavour. TVP isused to get that ground protein-like texture!","categories":[],"tags":[{"name":"thai","slug":"thai","permalink":"https://www.lakeisha.ca/tags/thai/"},{"name":"salad","slug":"salad","permalink":"https://www.lakeisha.ca/tags/salad/"},{"name":"spicy","slug":"spicy","permalink":"https://www.lakeisha.ca/tags/spicy/"}]}]}