{"meta":{"title":"Lakeisha's Lab","subtitle":"How can you have any pudding if you dont eat your veg?","description":"Recipes from all cultures","author":"Lakeisha Pogrzeba","url":"https://www.lakeisha.ca"},"pages":[{"title":"about","date":"2018-11-02T19:00:38.000Z","updated":"2018-11-09T13:52:23.041Z","comments":true,"path":"about/index.html","permalink":"https://www.lakeisha.ca/about/index.html","excerpt":"","text":"Hi, my name is Lakeisha and welcome to my website!List of sentances that begin with I I am a passionate foodie with no official culinary training! I hope that doesn’t deter you from trying my recipes. I have however learned from many of the different people in my life, and devote a lot of time to watching youtube, and self experimentation. I enjoy food from all cultures. I have a long list of recipes that I am working toward putting up here, as well as many recipes I’d like to try! I like to work like a micro processor. Meaning, I do as much as possible in parallel, so my recipe methods aims to save time! I am a Vegan and those are the only recipes you’ll find here! In addition to being passionate about a began lifestyle, I enjoy the challenge and creativity needed to veganize all recipes. If you have any questions comments or suggestions(such as recipes), feel free to reach out! ~ more about me to come"}],"posts":[{"title":"Scrambled Tofu","slug":"ScrambledTofu","date":"2018-11-03T16:17:00.000Z","updated":"2018-11-08T23:46:59.483Z","comments":true,"path":"scrambled-tofu/","link":"","permalink":"https://www.lakeisha.ca/scrambled-tofu/","excerpt":"","text":"Hearty and simple yet Flavourful Scrambled Tofu! This dish is so delicious and comforting! Its packed with protein, no LDL cholesterol, and Tofu has a much longer expiry date than eggs, so its easy to keep theingredients on hand! Recipe Medium size onion 4 garlic cloves 1 tablespoon avocado oil or other high smoke point oil 3/4 package of firm tofu one of your best tomatoes 1 teaspoon ground turmeric 1 teaspoon ground Cumin 1 teaspoon Salt 1/2 teaspoon ground Thyme half a Thai bird chili (optional) Method ~ Prep the vegetables ~ Dice your onion and tomatoe, mince your garlic. If you are using hot pepper, chop that up too. Add the oil to your pan. Set stove to high to get oil heated quickly, then bring it back down to 4/10 Add in the onion. Fry until translucent Then add in the garlic. Fry for another minute or until fragrant. Do not let in get brown. Add in the tomatoe. Add the whole thing, not to loose any juices.If you have frozen tomatoes, just microwave on a plate for 4 minutes.Then mash it down with a potatoe masher or something. Add the chilli pepper now as well if using. Add the Salt, black pepper, Cumin and Thyme. Start crumbling in your tofu. Sprinkle the Tumeric powder over the tofu now to give it that color(and also its anti-inflamatory and anti-oxidant properties!) Mix everything down and cook for a couple more minutes, until all liquid is absorbed/evaporated. ~Its done!~ Well, it probably is, but do a taste test, and adjust the salt or spices to your liking","categories":[],"tags":[{"name":"breakfast","slug":"breakfast","permalink":"https://www.lakeisha.ca/tags/breakfast/"}]},{"title":"La Pizza","slug":"Pizza","date":"2018-10-29T05:00:00.000Z","updated":"2018-11-09T15:05:43.349Z","comments":true,"path":"la-pizza/","link":"","permalink":"https://www.lakeisha.ca/la-pizza/","excerpt":"","text":"Find out my secret technique to making a cripsy Thin crust pizza! Servings: 1-4 medium thin-crust pizzasPrep-time: 30 minCook time: 15 min per pizza The pizza dough is a standard recipe, but its the cooking technique that really makes this pizza stand out as one of my favorite personally developed recipes! It results in a super crispy thin crust! Why have 1 thick pizza when you can have 4 thin pizzas? Thats 4 times as many vegetables! Recipe ~ Dough ~ This is for one batch of dough which can make 4 thin crust pizzas 2 cups flour 1 cup water 8g yeast, or 1 pack fleishmans yeast teaspoon of sugar pinch of salt ~ Sauces ~ Option 1: Garlic and chili -&gt; This is for one pizza’s worth of sauce 2 TableSpoons Olive Oil 5 minced garlic cloves 1 cherry pepper or wiri wiri pepper Option 2: Pesto -&gt; makes a large portion of pesto sauce 2 cups packed basil leaves 2 cloves garlic 1/4 cup pine nuts or walnuts 2/3 cup olive oil 3 table spoons plant parm or parmageddon or make your own plant parm using nutritional yeast(will figure this out in future) 1 teaspoon salt half teaspoon pepper Blend! Option 3: Passata base -&gt; This is one pizza’s worth 2 Table Spoons Olive Oil 4 Table Spoons Passata 5 Minced Garlic Cloves half a medium sized onion, minced Method ~ Pre ~ Pre-Heat oven to 500F. I would try with even hotter, but this is the highest my oven goes! If you are using any wet vegetables or mushrooms, Cut them up and place on a rack in the oven to dehydrateThis will help the pizza crust up properly! ~ Dough ~ Start with half a cup of tap-warm water. (I currently live in Toronto so we have the best tap-water in the world :p) Add the yeast and sugar. Give a lil stir. The sugar is food for your yeast! If your yeast is not expired or dead, it will begin to foam up in about a minute or two. Let it sit for 8 more minutes. There should be a lot of foam! Add the flour, yeast water, and remaining half of cup water to a large bowl and mix. Cover the bowl with a cloth and let sit for another 20-30 minutes. During this waiting time, you can prep any vegetables Knead the risen dough another minute and that’s it, the hardest part of pizza is done. ~ Roll out and Decorate ~ *There are two ways I make the pizza. one is rolling the dough on parchment paper and cooking on a pizza stone, the other just uses a cast iron pan. Heres the secret rolling technique. Begin Rolling the dough flouring each side only initially. Then, continue rolling it out, but do not flip it. let the underside stick to the surface. Continue to apply flour to the top to prevent your rolling pin (or wine bottle) from sticking to it. This will allow you to get an ultra thin crust! Continue until you have reach a size slightly larger than your cast iron pan. Apply some olive oil to the pan. Be slightly generous. If using parchment paper, no need. Transfer the dough into the pan now. This could be tricky, and make sure not to burn yourself on the pan. It it falls apart, just get it all in there and press the dough back together. Roll the dough up the edges. If using parchment paper, just leave it on the paper and move the whole thing onto your stone after it is decorated (after steps 4,5,6) Spread your sauce over the dough. When using passata or pesto sauce, a generous amount helps keep vegetables in place. Add your vegetables! Put the wetter ones on the outside near the criust edge, so they will dry out faster. Bake in the oven for about 15 minutes, or until desured crust crunchiness. I use a long knife to lift up the crust as a test to see its rigidy. ~ Veg Ideas ~ Olives, tomatoes, oregano, red onions, mushrooms. Thin Sweet potatoe slices, Pineapple stuffed crust, Green peppers. Thin potatoe slices, Artichoke hearts, broccoli, tomatoe slices. Basil Leaves, Tomatoes slices, vegan feta","categories":[],"tags":[{"name":"italian","slug":"italian","permalink":"https://www.lakeisha.ca/tags/italian/"},{"name":"comfort","slug":"comfort","permalink":"https://www.lakeisha.ca/tags/comfort/"}]},{"title":"Thai Larb","slug":"ThaiLarb","date":"2018-10-28T05:00:00.000Z","updated":"2018-11-08T16:43:10.037Z","comments":true,"path":"thai-larb/","link":"","permalink":"https://www.lakeisha.ca/thai-larb/","excerpt":"","text":"This TVP based salad features Mint, Lime, Culantro, Agave, and hot peppers! It is the lesser known Thai Larb! The mint and cullantro give ita wonderfully refreshing flavour. The hot peppers, agave syrup,soy sauce and broth round it out and pack in the flavour. TVP isused to get that ground protein-like texture! Recipe 2/3 cup TVP 1/2 cup water 1/2 cube veg stock 2 teaspoon Tamari 2 teaspoon Agave Syrup 1/2 cup Culantro leaves 1/2 cup mint leaves 1 Shallot 1 table spoon Toasted Sticky rice 1/2 hot cherry pepper 1/2 Lime Add the wet ingredients to your wok and bring to a boil. Use a Spoon to crush the veg stock cube and dissolve. Add TVP and stir, give it a light fry on 5/10 heat. Turn off the heat and add the shallot, hot pepper, Culantro and Mint leaves. Squeeze the lime into it, and taste. Adjust according to your likeing to balance the sweet(agave), salty(soy sauce), and spicy(pepper). Scoop into your serving bowl, and top with toasted sticky rice. ~ สนุก ~","categories":[],"tags":[{"name":"thai","slug":"thai","permalink":"https://www.lakeisha.ca/tags/thai/"},{"name":"salad","slug":"salad","permalink":"https://www.lakeisha.ca/tags/salad/"},{"name":"spicy","slug":"spicy","permalink":"https://www.lakeisha.ca/tags/spicy/"}]}]}